[{"title":"How to Print a Temperature Tower with Cura","content":"Temperature towers are a great way to test different temperatures quickly in a single print. It works by stacking repeated sections of a print, and changing the temperature in each of these sections. Temperature towers are a specific type of calibration tower, which can be used to test a number of different settings or combination of settings. \n Why might you want to do a temperature tower? Temperature can effect a host of print characteristics, including: \n \n Stringing \n Surface Quality and\/or surface finish \n Bridging performance \n Strength \n Extrusion quality \n \n This guide will specifically show you how to do a temperature tower in Cura. \n Below is a step-by-step guide to do an effective temperature tower, what to look for, and what to do when you have found a good temperature (or, what to do if your results are still sub-par) \n \n Choose a temperature tower model \n Use the Post-Processing change-at-z plugin \n Select your temperatures at the right height \n Print the part \n Interpret the results \n Print again, if applicable \n What to do if you&rsquo;re still having problems \n \n 1. Choose a temperature tower model &amp; load into Cura \n First, you must choose a temperature tower to print. You have two choices here: \n \n Download an existing temperature tower (recommended) \n Design your own temperature tower \n \n For this article, we used our specialized calibration model. We&rsquo;ve worked extra hard to optimize a model that prints with less than 1 gram of material and between 6 and 7 minutes for each level. \n You can download the single-level STL file from our&nbsp; Thangs &nbsp;or&nbsp; Printables &nbsp;profile. Each level is 8 mm tall (you&rsquo;ll need this information next).  \n Note: Our model works best with the following settings (these come pre-configured in a 3mf file as part of inTinker&rsquo;s calibration workflow). These settings will enable you to reach our print time and weight benchmarks: \n \n \n \n Cura","slug":"how-to-print-a-temperature-tower-with-cura"},{"title":"How to fix stringing in a 3D printed part","content":"Background: What is stringing or oozing \n Stringing, also called oozing, is one of the most common problems in 3D printing. Stringing usually takes on two common forms: \n 1) Larger, thicker strings of material, along the path between where the nozzle moves during printing:  \n 2) Finer, wispy strings, also along the same path, but because the strings are so light, they tend to also float around or move from your cooling fan:  \n Whenever your printer stops printing to travel to another area, then resumes printing, there&#039;s the potential for stringing to occur. For example, any part with two separate towers or columns can display stringing. \n Basically, when the extruder stops pushing, the material in your hotend continues heating up-and expands-which builds pressure behind the nozzle. There are two ways this pressure is relieved: filament oozes out of the nozzle, which causes that pesky stringing, or, your extruder &quot;retracts&quot; or pulls back the filament. And if these retractions not well-tuned, oozing can still occur. &quot;Retraction settings&quot; usually refer to the retraction distance and retraction speed, and even advanced settings like retraction retract speed. \n Factors that can cause stringing \n Other factors can complicate the process even more. For instance, hot-end temperature and layer height can change the situation enough where previously good retractions no longer relieve that pressure. Travel speed or print speed can have an effect too, but in our experience, these are not as dominant. Sometimes the toolpath can unnecessarily induce more stringing-or do a good job of hiding it. \n Thankfully, we&#039;ve prepared some of the most common solutions to stringing. Let&#039;s dive in! \n 1. Retraction \n Getting retraction settings sorted is key! Retraction settings are typically the cause of stringing. Increasing both retraction speed and retraction distance are important to eliminating stringing. Best practice is to increase retraction speed by increments of 5 mm\/sec","slug":"title"}]